Revit 2027 API
EnergyDataSettings.BuildingTypeId Property
 The building type element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BuildingTypeId { get; set; }
Public Property BuildingTypeId As ElementId
	Get
	Set
public:
property ElementId^ BuildingTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BuildingTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace